{
  "projects": [
    {
      "id": "gurkha-one",
      "title": "Gurkha One",
      "description": "A full-stack mobile app for the UK Nepalese community to discover and track local football tournaments.",
      "longDescription": "Built as my final year dissertation project, Gurkha One is a React Native mobile application designed for the Nepalese community in the UK. The app allows users to browse past, current, and upcoming football tournaments, create and manage their profiles, and stay connected with local football events. The backend is powered by Node.js with Express and TypeScript, using TypeORM for database management with token-based authentication. This project marked the beginning of my full-stack development journey, focusing on iOS development and RESTful API design.\n\nThrough this project, I developed key software engineering skills including gathering and incorporating user feedback, iterative delivery with continuous improvements, conducting user research to understand community needs, requirements analysis, and agile project management. These experiences shaped my approach to building user-centred applications.",
      "tags": ["React Native", "TypeScript", "Node.js", "MySQL", "TypeORM"],
      "links": {
        "github": "https://github.com/pratikpun/Gurkha-One-App"
      },
      "featured": true,
      "images": ["/images/projects/finalDashboard.png", "/images/projects/teamSCREEN.png"]
    },
    {
      "id": "bloo-fits",
      "title": "Bloo Fits",
      "description": "A front-end focused e-commerce app for browsing and purchasing clothing items with user authentication.",
      "longDescription": "Bloo Fits is an e-commerce application built to deepen my understanding of front-end development with React. The project features product browsing with nested routing, a shopping cart with quantity tracking, and user authentication. I used React Router DOM for declarative navigation, React Context API for global state management, and Firebase for authentication and data storage to keep the focus on front-end learning without building a custom backend.\n\nKey skills developed include component-based architecture, client-side routing patterns, state management with Context API, and integrating third-party services like Firebase.",
      "tags": ["React", "SCSS", "Firebase", "React Router", "Context API"],
      "links": {
        "github": "https://github.com/pratikpun/bloo-fits"
      },
      "featured": true
    },{
      "id": "async-pipeline",
      "title": "Async Notification Pipeline",
      "description": "A production-grade task service built with Python to master backend patterns: caching, queues, idempotency, and distributed systems.",
      "longDescription": "An async notification pipeline system designed to explore and implement production-level backend engineering patterns in Python. The project covers the full spectrum of modern backend development: RESTful API design with proper validation and DTOs, PostgreSQL with Alembic migrations, JWT authentication, Redis caching, background job processing, and distributed messaging patterns.\n\nKey patterns implemented include idempotency for safe retries, rate limiting, circuit breakers, the outbox pattern for reliable event publishing, and dead-letter queues for failure handling. These are foundational patterns used across industries like fintech, e-commerce, SaaS platforms, and any system requiring reliable notification delivery, task scheduling, or event-driven architecture at scale.",
      "tags": ["Python", "FastAPI", "PostgreSQL", "Redis", "Alembic", "JWT"],
      "links": {
        "github": "https://github.com/pratikpun/Async-Notification-Pipeline-System"
      },
      "featured": true
    }
  ]
}
